# Data Cleaning and Prepataion

## 7.1 Handling Missing Value

In [3]:
import numpy as np
import pandas as pd

string_data = pd.Series(["aardvark", "artichoke", np.nan, "avocado"])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [9]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [11]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [17]:
NA = np.nan

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [27]:
data = pd.DataFrame([[1., 6.5, 3.],
                     [1., NA, NA],
                     [NA, NA, NA],
                     [NA, 6.5, 3.]])

In [29]:
cleaned = data.dropna()

In [31]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [33]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [35]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [39]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [41]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [45]:
df = pd.DataFrame(np.random.rand(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.719796       NaN       NaN
1  0.972029       NaN       NaN
2  0.389272       NaN  0.559154
3  0.405278       NaN  0.163640
4  0.172426  0.710767  0.963575
5  0.581958  0.661698  0.460286
6  0.880524  0.491487  0.101195

In [47]:
df.dropna()

          0         1         2
4  0.172426  0.710767  0.963575
5  0.581958  0.661698  0.460286
6  0.880524  0.491487  0.101195

In [49]:
df.dropna(thresh=2)

          0         1         2
2  0.389272       NaN  0.559154
3  0.405278       NaN  0.163640
4  0.172426  0.710767  0.963575
5  0.581958  0.661698  0.460286
6  0.880524  0.491487  0.101195

### Filling In Missing Data

In [52]:
df.fillna(0)

          0         1         2
0  0.719796  0.000000  0.000000
1  0.972029  0.000000  0.000000
2  0.389272  0.000000  0.559154
3  0.405278  0.000000  0.163640
4  0.172426  0.710767  0.963575
5  0.581958  0.661698  0.460286
6  0.880524  0.491487  0.101195

In [56]:
df.fillna({1: 0.5,
           2: 0})

          0         1         2
0  0.719796  0.500000  0.000000
1  0.972029  0.500000  0.000000
2  0.389272  0.500000  0.559154
3  0.405278  0.500000  0.163640
4  0.172426  0.710767  0.963575
5  0.581958  0.661698  0.460286
6  0.880524  0.491487  0.101195

In [62]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.719796  0.000000  0.000000
1  0.972029  0.000000  0.000000
2  0.389272  0.000000  0.559154
3  0.405278  0.000000  0.163640
4  0.172426  0.710767  0.963575
5  0.581958  0.661698  0.460286
6  0.880524  0.491487  0.101195

In [64]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.243238  1.037574 -0.237484
1  0.477909  0.721912 -0.580902
2  1.462966       NaN  0.034611
3 -0.289904       NaN -0.134287
4 -1.484103       NaN       NaN
5 -0.022683       NaN       NaN

In [68]:
df.ffill()

          0         1         2
0 -0.243238  1.037574 -0.237484
1  0.477909  0.721912 -0.580902
2  1.462966  0.721912  0.034611
3 -0.289904  0.721912 -0.134287
4 -1.484103  0.721912 -0.134287
5 -0.022683  0.721912 -0.134287

In [70]:
df.ffill(limit=2)

          0         1         2
0 -0.243238  1.037574 -0.237484
1  0.477909  0.721912 -0.580902
2  1.462966  0.721912  0.034611
3 -0.289904  0.721912 -0.134287
4 -1.484103       NaN -0.134287
5 -0.022683       NaN -0.134287

In [72]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [82]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [84]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [86]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [88]:
data["v1"] = range(7)
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [92]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [36]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon", "Pastrami", "corned beef", "bacon", "pastrami", "honey ham", "nova lox"],
                    "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [38]:
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon"
}

In [40]:
lowercased = data["food"].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [42]:
data["animal"] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
data["food"].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [51]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [57]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
data.replace({-999:np.nan,
             -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [66]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                   columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [68]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [72]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [76]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [78]:
data.rename(index={"OHIO": "INDIANA"},
           columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [84]:
data.rename(index={"OHIO": "INDIANA"}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [91]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [99]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [101]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [103]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [107]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [109]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [121]:
data = np.random.randn(1000)
pd.cut(data, 4, precision=2)

[(-1.37, 0.026], (-1.37, 0.026], (-1.37, 0.026], (-1.37, 0.026], (0.026, 1.42], ..., (0.026, 1.42], (-1.37, 0.026], (1.42, 2.82], (0.026, 1.42], (-1.37, 0.026]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.78, -1.37] < (-1.37, 0.026] < (0.026, 1.42] < (1.42, 2.82]]

In [125]:
pd.cut(data, 4, precision=2).value_counts()

(-2.78, -1.37]     81
(-1.37, 0.026]    419
(0.026, 1.42]     427
(1.42, 2.82]       73
Name: count, dtype: int64

In [117]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.0666, 0.732], (0.0666, 0.732], (-0.666, 0.0666], (0.0666, 0.732], (0.732, 3.443], ..., (0.732, 3.443], (0.732, 3.443], (-2.686, -0.666], (0.0666, 0.732], (0.0666, 0.732]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.686, -0.666] < (-0.666, 0.0666] < (0.0666, 0.732] < (0.732, 3.443]]

In [119]:
cats.value_counts()

(-2.686, -0.666]    250
(-0.666, 0.0666]    250
(0.0666, 0.732]     250
(0.732, 3.443]      250
Name: count, dtype: int64

In [127]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])

[(-1.256, 0.0274], (-1.256, 0.0274], (-1.256, 0.0274], (-1.256, 0.0274], (0.0274, 1.205], ..., (0.0274, 1.205], (-1.256, 0.0274], (1.205, 2.821], (0.0274, 1.205], (-1.256, 0.0274]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.771, -1.256] < (-1.256, 0.0274] < (0.0274, 1.205] < (1.205, 2.821]]

### Detecting and Filtering Outliers

In [130]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.030017     0.004511    -0.035533    -0.016022
std       0.966963     1.010024     1.029348     1.048009
min      -3.351067    -3.259678    -3.183484    -2.989123
25%      -0.655772    -0.684171    -0.711579    -0.740568
50%      -0.027297    -0.021813    -0.038157    -0.030822
75%       0.633188     0.693112     0.652384     0.742999
max       2.824675     2.803524     2.805904     3.075432

In [134]:
col = data[2]
col[np.abs(col) > 3]

637   -3.183484
762   -3.055105
Name: 2, dtype: float64

In [170]:
data[(np.abs(data) > 3).any(axis=1)]

            0         1         2         3
190 -3.351067 -1.291960  0.209026 -0.925802
637  0.518278 -0.917488 -3.183484 -1.151906
659  0.840276 -1.889995  1.815632  3.075432
762  1.000529 -1.122652 -3.055105  1.410783
980 -0.419779 -3.259678 -2.249744 -1.331844

In [189]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.029666     0.004771    -0.035294    -0.016097
std       0.965819     1.009217     1.028642     1.047789
min      -3.000000    -3.000000    -3.000000    -2.989123
25%      -0.655772    -0.684171    -0.711579    -0.740568
50%      -0.027297    -0.021813    -0.038157    -0.030822
75%       0.633188     0.693112     0.652384     0.742999
max       2.824675     2.803524     2.805904     3.000000

In [191]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1 -1.0 -1.0 -1.0  1.0
2  1.0  1.0  1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4 -1.0  1.0 -1.0  1.0

In [193]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([0, 3, 4, 2, 1])

In [195]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [197]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7

In [201]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [207]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
0    5
4    4
0    5
0    5
2   -1
1    7
1    7
2   -1
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [230]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                  "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [232]:
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [240]:
dummies = pd.get_dummies(df["key"], prefix="key")
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

## 7.3 String manipulation

### String Object Methods

In [7]:
val = "a, b, guido"
val.split()

['a,', 'b,', 'guido']

In [9]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [10]:
first, second, third = pieces
first+"::"+second+"::"+third

'a::b::guido'

In [11]:
"::".join(pieces)

'a::b::guido'

In [22]:
"guido" in val

True

In [24]:
val.index(",")

1

In [26]:
val.find(":")

-1

In [28]:
val.index(":")

ValueError: substring not found

In [30]:
val.count(",")

2

In [32]:
val.replace(",", "::")

'a:: b:: guido'

In [34]:

val.replace(",", "")

'a b guido'

In [48]:
test = (1, 2, 3, 4)
val.count("a")

1

In [62]:
import re

text = "foo bar\t baz \tqux"
re.split(r'\s+', text)

['foo', 'bar', 'baz', 'qux']

In [66]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [68]:
regex.findall(text)

[' ', '\t ', ' \t']

In [74]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [78]:
m = regex.search(text)
m

In [80]:
text[m.start():m.end()]

'dave@google.com'

In [82]:
print(regex.match(text))

None

In [84]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [90]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [92]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [94]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in Pandas

In [103]:
data = {"Dave": "dave@google.com", 
        "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com",
        "Wes": np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [106]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [108]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [110]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [112]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [114]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [123]:
matches.astype(str).str.get(1)

Dave     r
Steve    r
Rob      r
Wes      a
dtype: object

In [127]:
matches.astype(str).str[0]

Dave     T
Steve    T
Rob      T
Wes      n
dtype: object

In [139]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object